InformationRegisters/ОповещенияПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОповещенияПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачалоОповещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонецОповещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПрочтения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доставлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НомерСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОповещенияПользователей/Forms/ФормаОтправкиУпр/Ext/Form/Module.bsl
Перем ШаблоныСоответствие;

#Область КлиентОповещенияПользователей

Функция ПолучитьСообщенияОбработкиОповещения()  Экспорт
	
	Получатель=ПараметрыСеанса.ТекущийПользователь;	
	
	СтруктураОбработкиОповещения = РегистрыСведений.ОповещенияПользователей.СтруктураОбработкиОповещения();

	УстановитьПривилегированныйРежим(истина);	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Оповещения.НомерСообщения,
	|	Оповещения.Получатель,
	|	Оповещения.НачалоОповещения,
	|	Оповещения.КонецОповещения,
	|	Оповещения.Дата,
	|	Оповещения.ВремяПрочтения,
	|	Оповещения.Отправитель,
	|	Оповещения.Сообщение,
	|	Оповещения.Доставлено,
	|	Оповещения.Ответ,
	|	Оповещения.Тема,
	|	Оповещения.Прочитано
	|ИЗ
	|	РегистрСведений.ОповещенияПользователей КАК Оповещения
	|ГДЕ
	|	Оповещения.Получатель = &Получатель
	|	И &ТекДата МЕЖДУ Оповещения.НачалоОповещения И Оповещения.КонецОповещения
	|	И НЕ Оповещения.Прочитано";
	
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Получатель",Получатель);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураОбработкиОповещения,Выборка);
	Иначе 
		СтруктураОбработкиОповещения = Неопределено;
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(ложь);
	
	Возврат СтруктураОбработкиОповещения;
КонецФункции

#КонецОбласти



#Область ОсновныеПроцедурыИФункцииМодуля

&НаСервере
Функция ОтправитьСообщенияСервер(ОтправлятьВсем=ложь)
	
	МассивОшибок = Новый Массив;
	
	УстановитьПривилегированныйРежим(истина);
	
	СохраняемыйТекстСообщения= ВызватьОбработкуТекстаСервер();
	
	Если  СохраняемыйТекстСообщения="" тогда  
		МассивОшибок.Добавить("Текст сообщения не заполнен!");
	КонецЕсли;
	
	Если МассивОшибок.Количество() = 0 Тогда
		
		Если ОтправлятьВсем Тогда
			
			Для Каждого Стр Из ТЧСоединения Цикл   
				
				СтруктураЗаписи = РегистрыСведений.ОповещенияПользователей.СтруктураОбработкиОповещения();
				
				ЗаполнитьЗначенияСвойств(СтруктураЗаписи,ЭтаФорма);
				СтруктураЗаписи.Вставить("Дата",		НачалоОповещения);
				СтруктураЗаписи.Вставить("Получатель",	РегистрыСведений.ОповещенияПользователей.НайтиПользователя(Стр));
				СтруктураЗаписи.Вставить("Сообщение",	СохраняемыйТекстСообщения);
				СтруктураЗаписи.Вставить("Отправитель",	ПараметрыСеанса.ТекущийПользователь);
				
				РегистрыСведений.ОповещенияПользователей.ЗаписатьОповещение(НомерСообщения,СтруктураЗаписи);
				
			КонецЦикла;
			
		Иначе
			ЕстьВыбранные = Ложь;
			Для Каждого Стр Из ТЧСоединения Цикл   
				
				Если Стр.Пометка Тогда
					
					СтруктураЗаписи = РегистрыСведений.ОповещенияПользователей.СтруктураОбработкиОповещения();
					ЗаполнитьЗначенияСвойств(СтруктураЗаписи,ЭтаФорма);
					СтруктураЗаписи.Вставить("Дата",		НачалоОповещения);
					СтруктураЗаписи.Вставить("Получатель",	РегистрыСведений.ОповещенияПользователей.НайтиПользователя(Стр));
					СтруктураЗаписи.Вставить("Сообщение",	СохраняемыйТекстСообщения);
					СтруктураЗаписи.Вставить("Отправитель",	ПараметрыСеанса.ТекущийПользователь);
					
					РегистрыСведений.ОповещенияПользователей.ЗаписатьОповещение(НомерСообщения,СтруктураЗаписи);
	
					Если Не ЕстьВыбранные Тогда
						ЕстьВыбранные = Истина;
					КонецЕсли; 
				КонецЕсли;
				
			КонецЦикла;
			
			Если Не ЕстьВыбранные Тогда
				МассивОшибок.Добавить("Пользователи не выбраны!");
			КонецЕсли; 
		КонецЕсли; 	

	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Ложь);	
	
	Возврат МассивОшибок;
КонецФункции 

#КонецОбласти



#Область  ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.ТолькоПросмотр <> Неопределено Тогда
	
		 ТолькоПросмотр = Истина;
	     НомерСообщения = Параметры.НомерСообщения;
	КонецЕсли; 
	                                    
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНасервере()

	Если Не ТолькоПросмотр Тогда
		
		НомерСообщения = РегистрыСведений.ОповещенияПользователей.ПолучитьСледНомерОповещения();
		
		Заголовок = "Оповещение №"+НомерСообщения;
		
		НачалоОповещения=Текущаядата();
		
		ИнтервалРассылки=10;
		
		КонецОповещения = Текущаядата()+120*60; //2 часа
		
		ВремяРеглРабот=10;
		
		ТолькоАктивныеПользователи = Истина;
		
		ЗаполнитьСписокПользователей();
		
		ЗаполнитьСписокШаблонов();
		
		ОбработкаВыбораШаблона();
		
	Иначе
		
		ЭтаФорма.ТолькоПросмотр = ТолькоПросмотр;
		
		Элементы.ТЧСоединения.Доступность = Ложь;
		Элементы.ТолькоРаботающиеПользователи.Доступность = Ложь;
		
		Элементы.ФормаОтправитьВсем.Доступность = Ложь;
		Элементы.ФормаОтправитьСообщение.Доступность = Ложь;
		
		Элементы.НачалоОповещения.доступность = Ложь;
		Элементы.ОкончаниеОповещения.доступность = Ложь;
		Элементы.ВремяРеглРабот.доступность = Ложь;

		Элементы.ТЧСоединения.Заголовок = "Доставлено";

		Элементы.АктивныеПользователиПометка.Заголовок ="Доставлено"; 
		Элементы.ТЧСоединенияОтметитьВсе.доступность = Ложь;
		Элементы.ТЧСоединенияСнятьВсе.доступность = Ложь;
		Элементы.ТЧСоединенияОбновить.доступность = Ложь;
		

		ТЧСоединения.Очистить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОповещенияПользователей.НомерСообщения,
		|	ОповещенияПользователей.Получатель,
		|	ОповещенияПользователей.НачалоОповещения,
		|	ОповещенияПользователей.КонецОповещения,
		|	ОповещенияПользователей.Дата,
		|	ОповещенияПользователей.ВремяПрочтения,
		|	ОповещенияПользователей.Отправитель,
		|	ОповещенияПользователей.Сообщение,
		|	ОповещенияПользователей.Доставлено,
		|	ОповещенияПользователей.Ответ,
		|	ОповещенияПользователей.Тема,
		|	ОповещенияПользователей.Прочитано
		|ИЗ
		|	РегистрСведений.ОповещенияПользователей КАК ОповещенияПользователей
		|ГДЕ
		|	ОповещенияПользователей.НомерСообщения = &НомерСообщения";
		
		Запрос.УстановитьПараметр("НомерСообщения", НомерСообщения);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СтрокаТЗ = ТЧСоединения.Добавить();
			СтрокаТЗ.Пометка 	  = Выборка.Доставлено;
			СтрокаТЗ.Пользователь = Выборка.Получатель;
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Выборка);

		Модифицированность = Ложь;
		
	КонецЕсли; 

КонецПроцедуры
 

&НаКлиенте
Процедура ПриЗакрытии()
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриОткрытииНасервере();
	
	Если Не ТолькоПросмотр Тогда
		
		ОтметитьВсе(Неопределено);
	КонецЕсли;
	
КонецПроцедуры
 
 
#КонецОбласти  



#Область  ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	ЗаполнитьСписокПользователей();

	ОбновитьИнтерфейс();
	
	ОтметитьВсе(Неопределено);
	
КонецПроцедуры  

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	// Вставить содержимое обработчика.
	Для Каждого Стр Из ТЧСоединения Цикл Стр.Пометка = Истина; КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	Для Каждого Стр Из ТЧСоединения Цикл	Стр.Пометка = Ложь; КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ОтправитьВсем(Команда)
	
	МассивОшибок = ОтправитьСообщенияСервер(Истина);
		
	Если МассивОшибок.Количество() = 0 Тогда
		Закрыть(); 
		Оповестить();
	Иначе
		Для каждого СтрОшибки Из МассивОшибок Цикл
			Сообщить(СтрОшибки,СтатусСообщения.Информация);
		КонецЦикла; 
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщение(Команда)
		
	МассивОшибок = ОтправитьСообщенияСервер();
	
		
	Если МассивОшибок.Количество() = 0 Тогда
		Закрыть(); 
		Оповестить();
	Иначе
		Для каждого СтрОшибки Из МассивОшибок Цикл
			Сообщить(СтрОшибки,СтатусСообщения.Информация);
		КонецЦикла; 
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ПросмотрОповещения(Команда)
	
	ПараметрыОткрытия = Новый Структура("НомерСообщения,Тема,Отправитель,Получатель,Сообщение,Ответ,ТолькоПросмотр");
	
	ПараметрыОткрытия.Вставить("НомерСообщения",НомерСообщения);
	ПараметрыОткрытия.Вставить("Тема",Тема);
	ПараметрыОткрытия.Вставить("Получатель","");
	ПараметрыОткрытия.Вставить("Отправитель",ПолучитьДанныеТекущегоПользователяКлиент());
	ПараметрыОткрытия.Вставить("Сообщение",ВызватьОбработкуТекстаСервер()); 
	ПараметрыОткрытия.Вставить("Ответ",	ПоказатьОтветПолучателя(Ответ));

	ПараметрыОткрытия.Вставить("ТолькоПросмотр",Истина);
	
	ОткрытьФорму("РегистрСведений.ОповещенияПользователей.Форма.ОповещениеУпр", ПараметрыОткрытия);
	
КонецПроцедуры


#КонецОбласти 




#Область  ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ШаблоныПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Шаблоны.ТекущиеДанные<>Неопределено Тогда
		
		ВариантШаблона = Элементы.Шаблоны.ТекущиеДанные.ВариантШаблона;
		
		Тема = Элементы.Шаблоны.ТекущиеДанные.Шаблон;

	КонецЕсли; 
	

	ОбработкаВыбораШаблона();
	
КонецПроцедуры


&НаКлиенте
Процедура ТолькоАктивныеПользователиПриИзменении(Элемент)
	ЗаполнитьСписокПользователей();
КонецПроцедуры

&НаКлиенте
Процедура ВызватьОбработкаВыбораШаблона()

	 ОбработкаВыбораШаблона();

КонецПроцедуры
 
#КонецОбласти  



#Область ДополнительныеПроцедурыИФункции

&НаСервере
Функция ПоказатьОтветПолучателя(Ответ)
	Возврат РегистрыСведений.ОповещенияПользователей.ПоказатьОтветПолучателя(Ответ);
КонецФункции // ()


Процедура ОбработкаВыбораШаблона()
	
	КонецОповещения=НачалоОповещения+?(ВариантШаблона=1,7200,600);

	Макет=РегистрыСведений.ОповещенияПользователей.ПолучитьМакет(ШаблоныСоответствие.Получить(ВариантШаблона));
	
	ТекстТТ=макет.ПолучитьТекст();
	
	СтруктураВложений			= Новый Структура;
		
	ТекстТТ=СтрЗаменить(ТекстТТ,"*НачалоШаблона", "Предварительно");

	ТекстТТ=СтрЗаменить(ТекстТТ,"*НачалаОбновления",формат(КонецОповещения,"ДЛФ=DDT")); 
	
	ВремяТехническихРабот = КонецОповещения+ВремяРеглРабот*60;
	
	ТекстТТ=СтрЗаменить(ТекстТТ,"*ВремяТехническихРабот",формат(ВремяТехническихРабот,"ДЛФ=DDT"));
	
	ТекстТТ=СтрЗаменить(ТекстТТ,"*ИмяБазы", Метаданные.Синоним);
	
	ТекстТТ=СтрЗаменить(ТекстТТ,"*Версия", Метаданные.Версия);

	ТекстТТ=СтрЗаменить(ТекстТТ,"*ОписаниеОбновления", "");

	ТекстТТ=СтрЗаменить(ТекстТТ,"*Отправитель", ПараметрыСеанса.ТекущийПользователь);
	
	ТекстСообщения.УстановитьHTML(ТекстТТ,СтруктураВложений);
	
КонецПроцедуры
 

&НаСервере
Процедура ЗаполнитьСписокПользователей()
	ТЧСоединения.Очистить();
	
	Если ТолькоАктивныеПользователи Тогда
		
		//Пользователи онлайн
		МассивПодключений = ПолучитьСоединенияИнформационнойБазы();
		
		
		Для Индекс = 0 По МассивПодключений.ВГраница()Цикл
			Если МассивПодключений[Индекс].ИмяПриложения = "1CV8" ИЛИ МассивПодключений[Индекс].ИмяПриложения = "1CV8C" Тогда
				
				Если МассивПодключений[Индекс].Пользователь <> Неопределено Тогда
					ПользовательИмя = СокрП(МассивПодключений[Индекс].Пользователь.Имя);
					Ид = Строка(МассивПодключений[Индекс].Пользователь.УникальныйИдентификатор);
					СтрокаТЗ = ТЧСоединения.Добавить();
					СтрокаТЗ.ИмяКомпьютера = МассивПодключений[Индекс].ИмяКомпьютера;
					СтрокаТЗ.Пользователь = МассивПодключений[Индекс].Пользователь.Имя;
                    СтрокаТЗ.ИдентификаторПользователяИБ = МассивПодключений[Индекс].Пользователь.УникальныйИдентификатор;

				КонецЕсли; 
				
			Иначе
				Продолжить;
			КонецЕсли;
			
		КонецЦикла; 
		
		
	Иначе
		Выборка = Справочники.Пользователи.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.ПометкаУдаления тогда
                Продолжить;
            КонецЕсли;
            СтрокаТЗ = ТЧСоединения.Добавить();
            СтрокаТЗ.Пользователь = Выборка.Код;
            СтрокаТЗ.ИдентификаторПользователяИБ = Выборка.ИдентификаторПользователяИБ;
            
        КонецЦикла; 
    КонецЕсли;  
    
КонецПроцедуры

//В значении используем имя шаблона, на сам шаблон вследствии органиченности платформы по 
//определению типа XDTO "Отсутствует отображение для типа 'ОболочкаHTMLДокумента'"
&НаСервере
Процедура ЗаполнитьСписокШаблонов()
	
	СтрТЗ = Шаблоны.Добавить();
	СтрТЗ.ВариантШаблона = 0;
	СтрТЗ.Шаблон = "Оповещение пользователей";
	
	СтрТЗ = Шаблоны.Добавить();
	СтрТЗ.ВариантШаблона = 1;
	СтрТЗ.Шаблон = "Технические работы (оповещение за  2 часа до начала)";
	
	СтрТЗ = Шаблоны.Добавить();
	СтрТЗ.ВариантШаблона = 2;
	СтрТЗ.Шаблон = "Технические работы (оповещение за 10 минут до начала)";
	
	СтрТЗ = Шаблоны.Добавить();
	СтрТЗ.ВариантШаблона = 3;
	СтрТЗ.Шаблон = "Вышла новая версия программы";
	
	СтрТЗ = Шаблоны.Добавить();
	СтрТЗ.ВариантШаблона = 4;
	СтрТЗ.Шаблон = "Обновление программы";
	
	СтрТЗ = Шаблоны.Добавить();
	СтрТЗ.ВариантШаблона = 5;
	СтрТЗ.Шаблон = "Сообщение";
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстHTMLВставкиФорматированногоДокумента(ФорматированныйДокумент) Экспорт
	// Обрабатываем комментарии
	ТекстHTML					= "";
	СтруктураВложений			= Новый Структура;
	ФорматированныйДокумент.ПолучитьHTML(ТекстHTML, СтруктураВложений); 
	// Получаем чистый HTML код вложений тела ФД
	п1 = Найти(ТекстHTML, "<body>"); 
	п2 = Найти(ТекстHTML, "</body>");
	
	ТекстHTML =СокрЛП(СтрЗаменить(Сред(ТекстHTML, п1, п2 - п1), "<body>", "")); 
	// Обрабатываем вложения и кодируем для вставки в HTML код
	Для Каждого ЭлементВложения Из СтруктураВложений Цикл
		Ключ		= ЭлементВложения.Ключ;
		Вложение	= ЭлементВложения.Значение;
		
		ФорматПикчи	= Вложение.Формат();
		
		КартинкаВКодировкеBase64= Base64Строка(Вложение.ПолучитьДвоичныеДанные());
		СтрокаПодстановкиHTML	= "data:image/"+ФорматПикчи+";base64,"+КартинкаВКодировкеBase64;
		ТекстHTML				= СтрЗаменить(ТекстHTML, Ключ, СтрокаПодстановкиHTML);
	КонецЦикла;
	// Вернем готовый текст HTML
	Возврат ТекстHTML;
КонецФункции

&НаСервере
Функция ВызватьОбработкуТекстаСервер()
	// Соответствие вставки HTML блоков ФД
	СоответствиеВставокФД = Новый Соответствие;
	// Создаем объект док HTML для сборки переданных ФД в 1 и вывода
	ДокументHTML = Новый ДокументHTML;
	// Плучим тело дока и вставим его в документ
	КорневойЭлемент = ДокументHTML.СоздатьЭлемент("BODY");
	ДокументHTML.ЭлементДокумента.ДобавитьДочерний(КорневойЭлемент);
	//*************************************************************
	//*************************************************************
	// Добавим узлы полученные из ФД поля номер 1 предварительно обрамив их разделительными линиями
	//Разделитель перед выводом ФД нмоер 1
	ЛинияРазделитель	= ДокументHTML.СоздатьЭлемент("hr");
	КорневойЭлемент.ДобавитьДочерний(ЛинияРазделитель);
	//-----------
	ТекстHTMLВставки	= ПолучитьТекстHTMLВставкиФорматированногоДокумента(ТекстСообщения);
	если   ТекстHTMLВставки="" тогда возврат ""; конецесли;
	//---
	УИДВставкиФД		= Строка(Новый УникальныйИдентификатор);
	//---
	СоответствиеВставокФД.Вставить(УИДВставкиФД, ТекстHTMLВставки);
	// Создаем из УИДа блок HTML и вставляем его в тело документа для последующей замены чистым HTML ФД
	ВставкаКодаФД		= ДокументHTML.СоздатьТекстовыйУзел(УИДВставкиФД);	
	КорневойЭлемент.ДобавитьДочерний(ВставкаКодаФД);
	//Разделитель после вывода ФД номер 1
	ЛинияРазделитель	= ДокументHTML.СоздатьЭлемент("hr");
	КорневойЭлемент.ДобавитьДочерний(ЛинияРазделитель);
	//*************************************************************
	//*************************************************************
	// Запишем сформированный HTML документ и получим его код для отображения
	ЗаписьHTML = Новый ЗаписьHTML;
	ЗаписьHTML.УстановитьСтроку();
	
	ЗаписьDOM = Новый ЗаписьDOM();
	ЗаписьDOM.Записать(ДокументHTML,ЗаписьHTML);
	// Получим текст HTML дока
	ЧистыйHTML = ЗаписьHTML.Закрыть();
	// Заменяем УИДы вставок на реальный код
	Для Каждого ОбъектСоответствияФД Из СоответствиеВставокФД Цикл	
		ЧистыйHTML = СтрЗаменить(ЧистыйHTML,ОбъектСоответствияФД.Ключ,ОбъектСоответствияФД.Значение);
	КонецЦикла;	
	// Выводим готовый HTML;
	//ПолеHTMLДокумента = ЧистыйHTML;
	возврат (ЧистыйHTML);
КонецФункции

&НаКлиенте
Функция ПолучитьДанныеТекущегоПользователяКлиент() 
	Возврат ПолучитьДанныеТекущегоПользователяСервер();
КонецФункции // ПолучитьДанныеТекущегоПользователя()
 

&НаСервере
Функция ПолучитьДанныеТекущегоПользователяСервер()
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции // ПолучитьДанныеТекущегоПользователя()
 

#КонецОбласти


ШаблоныСоответствие = Новый Соответствие;
ШаблоныСоответствие.Вставить(0,"Оповещение");
ШаблоныСоответствие.Вставить(1,"ЗавершениеЗа2Часа");
ШаблоныСоответствие.Вставить(2,"ЗавершениеЗа10Мин");
ШаблоныСоответствие.Вставить(3,"ВышлаНоваяВерсияПрограммы");
ШаблоныСоответствие.Вставить(4,"ОПрошедшемОбновлении");
ШаблоныСоответствие.Вставить(5,"ШаблонПустой");
